app/helpers/notes_helper.rb

SELECT "notes".* FROM "notes" WHERE "notes"."id" = 19 LIMIT 1
---
  def format_note_content(content, current_note_id: nil)
    formatted_content = content.dup

    # First, handle full note embeds at the start
    formatted_content = formatted_content.gsub(/\A\[\[(\d+)\]\]/) do |match|
      note_id = $1
      if referenced_note = Note.find_by(id: note_id)