app/controllers/notes_controller.rb

  def index
    base_query = if params[:q].present?
      Note.where("content ILIKE ?", "%#{params[:q]}%")
    elsif params[:tag]
      Note.where("content LIKE ?", "%##{params[:tag]}%")
    elsif params[:referencing]
      Note.referencing(params[:referencing])
    else
      Note.all
---
SELECT "notes".* FROM "notes" WHERE (content ILIKE '%dinheiro%') ORDER BY "notes"."created_at" DESC
SELECT "notes".* FROM "notes" ORDER BY "notes"."updated_at" DESC

  def starred
    @notes = Note.where(starred: true).order(created_at: :desc)
---
SELECT "notes".* FROM "notes" WHERE "notes"."starred" = TRUE ORDER BY "notes"."created_at" DESC

  def toggle_star
    @note = Note.find(params[:id])
    @note.update(starred: !@note.starred)
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = 8 LIMIT 1
UPDATE "notes" SET "updated_at" = '2025-01-07 19:13:14.512589', "starred" = TRUE WHERE "notes"."id" = 8

  def create
    @note = Note.new(note_params)

    if @note.save
---
INSERT INTO "notes" ("content", "created_at", "updated_at", "starred") VALUES ('Vamos ver como fica quando cria um novo mas tá pra mostrar o mais recentemente editado primeiro', '2025-01-07 20:32:14.099536', '2025-01-07 20:32:14.099536', FALSE) RETURNING "id"

  def update
    respond_to do |format|
      if @note.update(note_params)
---
UPDATE "notes" SET "content" = 'Todas as virtudes são um negar a si mesmo, um submeter nossos atos à razão, à verdade, ao bem, apesar de como nos sentimos a respeito.

  def destroy
    @note = Note.find(params[:id])
    @note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = 34 LIMIT 1
DELETE FROM "notes" WHERE "notes"."id" = 34

    def set_note
      @note = Note.find(params.expect(:id))
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = 25 LIMIT 1