app/models/note.rb

  def reference_count
    Note.where("content LIKE ?", "%[[#{id}]]%").count
---
SELECT COUNT(*) FROM "notes" WHERE (content LIKE '%[[20]]%')